export interface DocumentType {
    id: number
    name: string
}


export const documentTypes: DocumentType[] = [
    {id: 100, name: 'הזמנה'},
    {id: 200, name: 'תעודת משלוח'},
    {
        id: 205,
        name: 'תעודת משלוח סוכן'
    },
    {id: 210, name: 'תעודת החזרה'},
    {id: 300, name: 'חשבונית/חשבונית עסקה'},
    {id: 305, name: 'חשבונית-מס'},
    {
        id: 310,
        name: 'חשבונית ריכוז'
    },
    {id: 320, name: 'חשבונית מס / קבלה'},
    {id: 330, name: 'חשבונית מס זיכוי'},
    {
        id: 340,
        name: 'חשבונית שריון'
    },
    {id: 345, name: 'חשבונית סוכן'},
    {id: 400, name: 'קבלה'},
    {id: 405, name: 'קבלה על תרומות'},
    {
        id: 410,
        name: 'יציאה מקופה'
    },
    {id: 420, name: 'הפקדת בנק'},
    {id: 500, name: 'הזמנת רכש'},
    {id: 600, name: 'תעודת משלוח רכש'},
    {
        id: 610,
        name: 'החזרת רכש'
    },
    {id: 700, name: 'חשבונית מס רכש'},
    {id: 710, name: 'זיכוי רכש'},
    {id: 800, name: 'יתרת פתיחה'},
    {
        id: 810,
        name: 'כניסה כללית למלאי'
    },
    {id: 820, name: 'יציאה כללית מהמלאי'},
    {id: 830, name: 'העברה בין מחסנים'},
    {
        id: 840,
        name: 'עדכון בעקבות ספירה'
    },
    {id: 900, name: 'דוח ייצור-כניסה'},
    {id: 910, name: 'דוח ייצור-יציאה'},]
